wrk/0.orig/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0; 

boundaryField
{
   "(north|south|east)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    default
    {
        type            zeroGradient;
    }

    west
    {
        type            fixedValue;
        value           uniform 0.42459422465424446;
    } 


}


// ************************************************************************* //
