wrk/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
(
    {
        // Name of new patch
        name inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set hvac1;
    }
    {
        // Name of new patch
        name inlet2;
     
        // Dictionary to construct new patch from
       patchInfo
        {
        type patch;
        }
     
       // How to construct: either from 'patches' or 'set'
       constructFrom set;
     
       // If constructFrom = set : name of faceSet
       set hvac2;
       }    
//----------------------------------------------------
   {
    // Name of new patch
    name return1a;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f1a;
   }
   {
    // Name of new patch
    name return1b;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f1b;
   }

//----------------------------------------------------
   {
    // Name of new patch
    name return2a;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f2a;
   }
   {
    // Name of new patch
    name return2b;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f2b;
   }
//----------------------------------------------------
   {
    // Name of new patch
    name return3a;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f3a;
   }
   {
    // Name of new patch
    name return3b;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f3b;
   }
//----------------------------------------------------
   {
    // Name of new patch
    name return4a;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f4a;
   }   
   {
    // Name of new patch
    name return4b;

    // Dictionary to construct new patch from
    patchInfo
    {
    type patch;
    }

    // How to construct: either from 'patches' or 'set'
    constructFrom set;

    // If constructFrom = set : name of faceSet
    set f4b;
   }   
//----------------------------------------------------
   {
    // Name of new patch
    name backrack1;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack1;
   }
   {
    // Name of new patch
    name backrack2;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack2;
   }
   {
    // Name of new patch
    name backrack3;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack3;
   }

   {
    // Name of new patch
    name backrack4;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack4;
   }
   {
    // Name of new patch
    name backrack5;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack5;
   }
   {
    // Name of new patch
    name backrack6;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack6;
   }
   
   {
   // Name of new patch
   name hotbattery;

   // Dictionary to construct new patch from
  patchInfo
   {
   type patch;
   }

  // How to construct: either from 'patches' or 'set'
  constructFrom set;

  // If constructFrom = set : name of faceSet
  set faulty;
  }
//****************************** //

#include "patch.h"  

//************************* // 


);

// ************************************************************************* //
